def main():

    print_symbols()

    # sample_tables()


def print_symbols():

    hex = (0x2500,0x2502,0x250C,0x2510,0x2514,0x2518,0x251C,0x2524,
           0x252C,0x2534,0x253C,0x2550,0x2551,0x2552,0x2553,0x2554,
           0x2555,0x2556,0x2557,0x2558,0x2559,0x255A,0x255B,0x255C,
           0x255D,0x255E,0x255F,0x2560,0x2561,0x2562,0x2563,0x2564,
           0x2565,0x2566,0x2567,0x2568,0x2569,0x256A,0x256B,0x256C)

    print("┌────┬────┬──────┐")
    print("│dec │hex │symbol│")
    print("├────┼────┼──────┤")

    for h in hex:
       
       print(f"│{h:0d}│{h:0X}│  {chr(h)}   │")

    print("└────┴────┴──────┘")


def sample_tables():

    print("┌───┬───┐")
    print("│abc│def│")
    print("├───┼───┤")
    print("│123│456│")
    print("├───┼───┤")
    print("│654│321│")
    print("└───┴───┘")

    print("┌───┬───┐")
    print("│abc│def│")
    print("├───┼───┤")
    print("│123│456│")
    print("│654│321│")
    print("└───┴───┘")

    print("╒═══╤═══╕")
    print("│abc│def│")
    print("╞═══╪═══╡")
    print("│123│456│")
    print("╘═══╧═══╛")

    print("╓───╥───╖")
    print("║abc║def║")
    print("╟───╫───╢")
    print("║123║456║")
    print("╙───╨───╜")

    print("╔═══╦═══╗")
    print("║abc║def║")
    print("╠═══╬═══╣")
    print("║123║456║")
    print("╚═══╩═══╝")

    print("╒═══╤═══╕")
    print("│abc│def│")
    print("╞═══╪═══╡")
    print("│123│456│")
    print("├───┼───┤")
    print("│654│321│")
    print("└───┴───┘")


if __name__ == "__main__":

    main()